# Brewfile — GENERATED by app-picker from config/apps.conf. Do not edit by hand.
# Regenerate: app-picker   (or app-picker --defaults)
# Install:    brew bundle --file=config/Brewfile
# Policy: official casks + Mac App Store only; never --no-quarantine.

# mas-cli drives Mac App Store installs (must be signed into the App Store).
brew "mas"

# ── CLI formulae ──
brew "switchaudio-osx"

# ── Casks (official Homebrew casks) ──
cask "aldente"
cask "alfred"
cask "antinote"
cask "appcleaner"
cask "macmediakeyforwarder"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "codex-app"
cask "cold-turkey-blocker"
cask "cursor"
cask "dropbox"
cask "finetune"
cask "finicky"
cask "ghostty"
cask "google-drive"
cask "granola"
cask "keyboardcleantool"
cask "lulu"
cask "malwarebytes"
cask "mouseless"
cask "nordvpn"
cask "notion"
cask "popclip"
cask "readdle-spark"
cask "slack"
cask "spotify"
cask "stats"
cask "super-productivity"
cask "tailscale-app"
cask "voiceink"
cask "zed"

# ── Mac App Store (sandboxed, Apple-reviewed) ──
mas "2FAS Auth Browser Extension", id: 6443941139
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Things 3", id: 904280696
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
